<?php

return [
    'validations' => [
        'consultation' => [
            'required' => 'الإستشاره مطلوبة',
            'you_are_already_asked_your_consultation' => 'لقد قدمت إستشارتك بالفعل في هذا الاشتراك',
        ]
    ],
    'users' => [
        'user_blocked' => 'تم حظر حسابك من الاستخدام',
        'otp' => [
            'messages' => [
                'otp_is_expired_resend_again' => 'إنتهت صلاحية كود التفعيل الخاص بك حاول مره اخري',
                'your_otp_is_wrong' => 'كود التفعيل الخاص بك خطأ',
                'your_otp_is' => 'كود التفعيل الخاص  بك : ',
                'we_are_send_otp_to_verify_your_phone' => 'تم إرسال كود التفعيل لتأكيد رقم هاتفك',
            ],
        ],
        'validation' => [
            'current_password' => [
                'required' => 'ادخل كلمة المرور الحالية',
                'not_match' => ' كلمة المرور الحالية غير صحيحة',
            ],
            'email' => [
                'required' => 'من فضلك ادخل البريد الالكتروني',
                'unique' => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile' => [
                'digits_between' => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric' => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required' => 'من فضلك ادخل رقم الهاتف',
                'unique' => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'otp' => [
                'required' => 'من فضلك ادخل كود التأكيد',
            ],
            'name' => [
                'required' => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password' => [
                'min' => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required' => 'من فضلك ادخل كلمة المرور',
                'same' => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
        ],
    ],
];
