<?php
return[
    'password' => [
        'mail' => [
            'subject'   => 'تعين كلمة مرور جديدة',
        ],
        'messages'  => [
            'success'   => 'تم ارسال تعين كلمة المرور الجديدة بنجاح عبر البريد الالكتروني',
            'updated_success'   => 'تم تغيير كلمة المرور بنجاح',
        ],
    ],
    'reset'             => [
        'mail'          => [
            'button_content'    => 'تعين كلمة مرور جديدة',
            'header'            => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعين كلمة مرور جديدة لفقدانك القديمة',
            'subject'           => 'تعين كلمة مرور جديدة',
        ],
        'title'         => 'تعين كلمة مرور جديدة',
        'validation'    => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'exists'    => 'هذا البريد غير موجود لدينا',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password'  => [
                'min'       => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required'  => 'يجب ان تدخل كلمة المرور',
                'confirmed' => 'كلمات السر غير متطابقة',
            ],
            'token'     => [
                'exists'    => 'انتهت صلاحية هذا الدفع , قم بإعادة إرسال كود التفعيل',
                'required'  => 'لا تملك صلاحية تعين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
    ],
];