<?php

return [
    'contact_us' => [
        'alerts' => [
            'send_message' => 'تم ارسال الرسالة بنجاح',
        ],
        'form' => [
            'btn' => [
                'send' => 'ارسال',
            ],
            'email' => 'البريد الالكتروني',
            'message' => 'الرسالة',
            'mobile' => 'الهاتف',
            'username' => 'الاسم',
        ],
        'info' => [
            'email' => 'البريد الالكتروني',
            'mobile' => 'الهاتف',
            'title' => 'بيانات التواصل',
            'our_site' => 'موقعنا',
            'technical_support' => 'الدعم الفني',
            'address' => 'العنوان',
        ],
        'mail' => [
            'header' => 'لقد استقبلنا رسالة تواصل معنا جديدة من احد الزوار',
            'subject' => 'تواصل معانا',
        ],
        'title' => 'تواصل معانا',
        'title_2' => 'ارسل لنا رسالة لنتواصل معك',
        'header_title' => 'اتصل بنا',
        'validations' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'message' => [
                'min' => 'يجب الا تقل الرسالة عن ١٠ احرف',
                'required' => 'من فضلك ادخل الرسالة النصية',
                'string' => 'من فضلك ادخل الرسالة النصية ارقام و حروف فقط',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الهاتف ارقام فقط',
                'required' => 'من فضلك ادخل رقم الهاتف',
            ],
            'username' => [
                'min' => 'يجب الا يقل اسم المستخدم عن ٣ احرف',
                'required' => 'من فضلك ادخل اسم المستخدم',
                'string' => 'يجب ان يتكون اسم المستخدم من احرف و ارقام فقط',
            ],
        ],
    ],
];
